In [1]:
from lib.modules_hotstar import describe_data, transform_countdata, process_data

In [2]:
train_X, train_Y,  test, details = describe_data('data/hotstar')

Directory Read from:data/hotstar/*

Files Read:

data/hotstar/train_data.json

data/hotstar/test_data.json

data/hotstar/sample_submission.csv

In [3]:
test.head()

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ID</th>
      <th>cities</th>
      <th>genres</th>
      <th>titles</th>
      <th>dow</th>
      <th>tod</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>test-1</td>
      <td>delhi:182,mumbai:702</td>
      <td>Romance:182,Cricket:702</td>
      <td>Axar's 21-ball 40 amidst KXIP ruins:72,Virat K...</td>
      <td>2:182,4:701</td>
      <td>13:182,15:701</td>
    </tr>
    <tr>
      <th>1</th>
      <td>test-10</td>
      <td>pune:16,delhi:1100,navi mumbai:22736</td>
      <td>Romance:50,Action:3501,Mythology:20300</td>
      <td>Besh Korechi Prem Korechi:0,Power:122,Siya Ke ...</td>
      <td>1:4830,3:3078,2:8359,5:2946,4:4185,7:451</td>
      <td>20:6909,21:1520,22:662,23:3160,19:5711,1:121,0...</td>
    </tr>
    <tr>
      <th>2</th>
      <td>test-100</td>
      <td>chennai:8652,delhi:751,mumbai:4470</td>
      <td>TalkShow:2247,Mythology:11626</td>
      <td>Mahabharat:11626,Koffee With Karan:2247</td>
      <td>1:5409,2:740,4:1162,7:2755,6:3807</td>
      <td>11:23,10:499,13:1804,12:1467,15:751,14:14,22:3...</td>
    </tr>
    <tr>
      <th>3</th>
      <td>test-1000</td>
      <td>pune:15,delhi:4872,mumbai:1849</td>
      <td>Drama:6459,Reality:276</td>
      <td>Dance +:276,Dance  :0,Chandanamazha:6458,Karut...</td>
      <td>1:3227,3:2043,7:1464</td>
      <td>14:15,17:1758,16:4185,19:128,23:468,6:180</td>
    </tr>
    <tr>
      <th>4</th>
      <td>test-10000</td>
      <td>mumbai:1204</td>
      <td>Drama:1204</td>
      <td>Yeh Rishta Kya Kehlata Hai:1204</td>
      <td>1:1204</td>
      <td>19:1204</td>
    </tr>
  </tbody>
</table>
</div>

In [12]:
train_Y.head()

0    neg
1    neg
2    neg
3    neg
4    neg
Name: segment, dtype: object

In [5]:
train_X = process_data(train_X)
test_X = process_data(test)
train_Y = process_data(train_Y)

DataFrame'>

DataFrame'>

Series'>

In [6]:
train_X.head()

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ID</th>
      <th>genre_count</th>
      <th>title_count</th>
      <th>city_count</th>
      <th>tod_count</th>
      <th>dow_count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>train-1</td>
      <td>3</td>
      <td>60</td>
      <td>2</td>
      <td>14</td>
      <td>7</td>
    </tr>
    <tr>
      <th>1</th>
      <td>train-10</td>
      <td>2</td>
      <td>70</td>
      <td>3</td>
      <td>16</td>
      <td>7</td>
    </tr>
    <tr>
      <th>2</th>
      <td>train-100</td>
      <td>2</td>
      <td>2</td>
      <td>1</td>
      <td>3</td>
      <td>1</td>
    </tr>
    <tr>
      <th>3</th>
      <td>train-1000</td>
      <td>2</td>
      <td>8</td>
      <td>3</td>
      <td>6</td>
      <td>5</td>
    </tr>
    <tr>
      <th>4</th>
      <td>train-10000</td>
      <td>3</td>
      <td>11</td>
      <td>2</td>
      <td>9</td>
      <td>5</td>
    </tr>
  </tbody>
</table>
</div>

In [7]:
test_X.head()

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ID</th>
      <th>genre_count</th>
      <th>title_count</th>
      <th>city_count</th>
      <th>tod_count</th>
      <th>dow_count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>test-1</td>
      <td>2</td>
      <td>8</td>
      <td>2</td>
      <td>2</td>
      <td>2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>test-10</td>
      <td>3</td>
      <td>10</td>
      <td>3</td>
      <td>8</td>
      <td>6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>test-100</td>
      <td>2</td>
      <td>2</td>
      <td>3</td>
      <td>11</td>
      <td>5</td>
    </tr>
    <tr>
      <th>3</th>
      <td>test-1000</td>
      <td>2</td>
      <td>4</td>
      <td>3</td>
      <td>6</td>
      <td>3</td>
    </tr>
    <tr>
      <th>4</th>
      <td>test-10000</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
train_Y.head()

0    neg
1    neg
2    neg
3    neg
4    neg
Name: segment, dtype: object